`terraform plan` output
```
Terraform will perform the following actions:

  # aws_lambda_function.dlcs_path_rewrite will be updated in-place
  ~ resource "aws_lambda_function" "dlcs_path_rewrite" {
        id                             = "cf_edge_dlcs_path_rewrite"
      ~ last_modified                  = "2024-12-12T14:19:12.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34/invocations" -> (known after apply)
      ~ s3_object_version              = "uG7BXeS7aG_ll.d6r8CySqDMetfHHqmY" -> "6K_AYuZxX3dwdT6_1EjWgcssncg6z7wL"
        tags                           = {}
      ~ version                        = "34" -> (known after apply)
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.iiif-prod.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                              = "E1KKXGJWOADM2A"
        tags                            = {
            "Managed" = "terraform"
        }
        # (23 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_auth" -> null
          - origin_path              = "/auth/2" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_auth_v2" -> null
          - origin_path              = "/auth/v2/access/2" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_auth_v2_probe" -> null
          - origin_path              = "/auth/v2/probe/2/5" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_av" -> null
          - origin_path              = "/iiif-av/wellcome/5" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_images" -> null
          - origin_path              = "/iiif-img/wellcome/5" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }

          - origin_shield {
              - enabled              = true -> null
              - origin_shield_region = "eu-west-1" -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_thumbs" -> null
          - origin_path              = "/thumbs/wellcome/5" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_wellcome_images" -> null
          - origin_path              = "/iiif-img/wellcome/8" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }

          - origin_shield {
              - enabled              = true -> null
              - origin_shield_region = "eu-west-1" -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_wellcome_thumbs" -> null
          - origin_path              = "/thumbs/wellcome/8" -> null
            # (1 unchanged attribute hidden)

          - custom_header {
              - name  = "X-Forwarded-Host" -> null
              - value = "iiif.wellcomecollection.org" -> null
            }

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dash.wellcomecollection.digirati.io" -> null
          - origin_id                = "dashboard" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dds.wellcomecollection.digirati.io" -> null
          - origin_id                = "iiif" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_file" -> null
          - origin_path              = "/file/wellcome/5" -> null
            # (1 unchanged attribute hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dlcs.io" -> null
          - origin_id                = "dlcs_pdf" -> null
          - origin_path              = "/pdf/wellcome/pdf/5" -> null
            # (1 unchanged attribute hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "pdf.wellcomecollection.digirati.io" -> null
          - origin_id                = "pdf_cover" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "dlcs.io"
          + origin_id                = "dlcs_images"
          + origin_path              = "/iiif-img/wellcome/5"
            # (1 unchanged attribute hidden)

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "dlcs.io"
          + origin_id                = "dlcs_wellcome_images"
          + origin_path              = "/iiif-img/wellcome/8"
            # (1 unchanged attribute hidden)

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_auth"
          + origin_path         = "/auth/2"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_auth_v2"
          + origin_path         = "/auth/v2/access/2"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_auth_v2_probe"
          + origin_path         = "/auth/v2/probe/2/5"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_av"
          + origin_path         = "/iiif-av/wellcome/5"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_thumbs"
          + origin_path         = "/thumbs/wellcome/5"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_wellcome_thumbs"
          + origin_path         = "/thumbs/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dash.wellcomecollection.digirati.io"
          + origin_id           = "dashboard"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dds.wellcomecollection.digirati.io"
          + origin_id           = "iiif"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_file"
          + origin_path         = "/file/wellcome/5"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "dlcs.io"
          + origin_id           = "dlcs_pdf"
          + origin_path         = "/pdf/wellcome/pdf/5"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "pdf.wellcomecollection.digirati.io"
          + origin_id           = "pdf_cover"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

        # (31 unchanged blocks hidden)
    }

  # module.iiif-stage.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                              = "E1ADWCLNPHV609"
        tags                            = {
            "Managed" = "terraform"
        }
        # (23 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (21 unchanged blocks hidden)
    }

  # module.iiif-test.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                              = "E2RTRZI6TQCGOR"
        tags                            = {
            "Managed" = "terraform"
        }
        # (23 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:34" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (21 unchanged blocks hidden)
    }

  # module.iiif-waf-prod.aws_wafv2_regex_pattern_set.lenient_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "lenient_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-lenient-urls-prod"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/image$"
        }
      + regular_expression {
          + regex_string = "^\\/thumbs$"
        }
    }

  # module.iiif-waf-prod.aws_wafv2_regex_pattern_set.restricted_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "restricted_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-restricted-urls-prod"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/presentation\\/collections$"
        }
    }

  # module.iiif-waf-prod.aws_wafv2_web_acl.acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "acl" {
        id                          = "378924d5-ba39-4550-b812-e04528d3c98e"
        name                        = "iiif-cloudfront-acl-prod"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "bot-control-rule-group" -> null
          - priority = 4 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      - aws_managed_rules_bot_control_rule_set {
                          - enable_machine_learning = false -> null
                          - inspection_level        = "COMMON" -> null
                        }
                    }

                  - rule_action_override {
                      - name = "CategoryAdvertising" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryArchiver" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryContentFetcher" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryEmailClient" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryHttpLibrary" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryLinkChecker" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMiscellaneous" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMonitoring" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryScrapingFramework" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySearchEngine" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySecurity" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySocialMedia" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryAI" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalAutomatedBrowser" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalKnownBotDataCenter" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalNonBrowserUserAgent" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-bot-control-prod" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "core-rule-group" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - rule_action_override {
                      - name = "EC2MetaDataSSRF_QUERYARGUMENTS" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SizeRestrictions_BODY" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-core-prod" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "known-bad-inputs-rule-group" -> null
          - priority = 3 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-known-bad-inputs-prod" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "managed-ip-blocking" -> null
          - priority = 0 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-ip-block-prod" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "sqli-rule-group" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesSQLiRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - rule_action_override {
                      - name = "SQLiExtendedPatterns_QUERYARGUMENTS" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SQLi_QUERYARGUMENTS" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-sqli-prod" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "geo-rate-limit-APAC"
          + priority = 3

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 500

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "CN",
                              + "SG",
                              + "HK",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-apac-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "geo-rate-limit-LATAM"
          + priority = 4

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 200

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "BR",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-latam-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "blanket-rate-limiting"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2500
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-acl-rate-limit-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "lenient-rate-limiting"
          + priority = 7

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 10000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-lenient-rate-limit-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "restrictive-rate-limiting"
          + priority = 6

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-restrictive-rate-limit-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "bot-control-rule-group"
          + priority = 13

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      + aws_managed_rules_bot_control_rule_set {
                          + enable_machine_learning = true
                          + inspection_level        = "COMMON"
                        }
                    }

                  + rule_action_override {
                      + name = "CategoryAdvertising"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryArchiver"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryContentFetcher"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryEmailClient"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryHttpLibrary"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryLinkChecker"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMiscellaneous"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMonitoring"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryScrapingFramework"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySearchEngine"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySecurity"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySocialMedia"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryAI"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalAutomatedBrowser"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalKnownBotDataCenter"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalNonBrowserUserAgent"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-bot-control-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "core-rule-group"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + rule_action_override {
                      + name = "EC2MetaDataSSRF_QUERYARGUMENTS"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SizeRestrictions_BODY"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-core-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "known-bad-inputs-rule-group"
          + priority = 12

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-known-bad-inputs-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "managed-ip-blocking"
          + priority = 0

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-ip-block-prod"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "sqli-rule-group"
          + priority = 11

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-sqli-prod"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.iiif-waf-stage.aws_wafv2_regex_pattern_set.lenient_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "lenient_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-lenient-urls-stage"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/image$"
        }
      + regular_expression {
          + regex_string = "^\\/thumbs$"
        }
    }

  # module.iiif-waf-stage.aws_wafv2_regex_pattern_set.restricted_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "restricted_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-restricted-urls-stage"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/presentation\\/collections$"
        }
    }

  # module.iiif-waf-stage.aws_wafv2_web_acl.acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "acl" {
        id                          = "1bf88c6b-2326-4140-a075-fd1e038c3d67"
        name                        = "iiif-cloudfront-acl-stage"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "bot-control-rule-group" -> null
          - priority = 4 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      - aws_managed_rules_bot_control_rule_set {
                          - enable_machine_learning = false -> null
                          - inspection_level        = "COMMON" -> null
                        }
                    }

                  - rule_action_override {
                      - name = "CategoryAdvertising" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryArchiver" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryContentFetcher" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryEmailClient" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryHttpLibrary" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryLinkChecker" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMiscellaneous" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMonitoring" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryScrapingFramework" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySearchEngine" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySecurity" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySocialMedia" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryAI" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalAutomatedBrowser" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalKnownBotDataCenter" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalNonBrowserUserAgent" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-bot-control-stage" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "core-rule-group" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - rule_action_override {
                      - name = "EC2MetaDataSSRF_QUERYARGUMENTS" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SizeRestrictions_BODY" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-core-stage" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "known-bad-inputs-rule-group" -> null
          - priority = 3 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-known-bad-inputs-stage" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "managed-ip-blocking" -> null
          - priority = 0 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-ip-block-stage" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "sqli-rule-group" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesSQLiRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-sqli-stage" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "geo-rate-limit-APAC"
          + priority = 3

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 500

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "CN",
                              + "SG",
                              + "HK",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-apac-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "geo-rate-limit-LATAM"
          + priority = 4

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 200

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "BR",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-latam-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "blanket-rate-limiting"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2500
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-acl-rate-limit-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "lenient-rate-limiting"
          + priority = 7

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 10000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-lenient-rate-limit-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "restrictive-rate-limiting"
          + priority = 6

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-restrictive-rate-limit-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "bot-control-rule-group"
          + priority = 13

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      + aws_managed_rules_bot_control_rule_set {
                          + enable_machine_learning = true
                          + inspection_level        = "COMMON"
                        }
                    }

                  + rule_action_override {
                      + name = "CategoryAdvertising"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryArchiver"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryContentFetcher"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryEmailClient"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryHttpLibrary"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryLinkChecker"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMiscellaneous"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMonitoring"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryScrapingFramework"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySearchEngine"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySecurity"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySocialMedia"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryAI"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalAutomatedBrowser"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalKnownBotDataCenter"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalNonBrowserUserAgent"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-bot-control-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "core-rule-group"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + rule_action_override {
                      + name = "EC2MetaDataSSRF_QUERYARGUMENTS"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SizeRestrictions_BODY"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-core-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "known-bad-inputs-rule-group"
          + priority = 12

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-known-bad-inputs-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "managed-ip-blocking"
          + priority = 0

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-ip-block-stage"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "sqli-rule-group"
          + priority = 11

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-sqli-stage"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.iiif-waf-test.aws_wafv2_regex_pattern_set.lenient_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "lenient_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-lenient-urls-test"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/image$"
        }
      + regular_expression {
          + regex_string = "^\\/thumbs$"
        }
    }

  # module.iiif-waf-test.aws_wafv2_regex_pattern_set.restricted_urls will be created
  + resource "aws_wafv2_regex_pattern_set" "restricted_urls" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "iiif-restricted-urls-test"
      + scope      = "CLOUDFRONT"
      + tags_all   = (known after apply)

      + regular_expression {
          + regex_string = "^\\/presentation\\/collections$"
        }
    }

  # module.iiif-waf-test.aws_wafv2_web_acl.acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "acl" {
        id                          = "eff1012c-1780-48d5-86ce-47cf65187dac"
        name                        = "iiif-cloudfront-acl-test"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "bot-control-rule-group" -> null
          - priority = 4 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesBotControlRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      - aws_managed_rules_bot_control_rule_set {
                          - enable_machine_learning = false -> null
                          - inspection_level        = "COMMON" -> null
                        }
                    }

                  - rule_action_override {
                      - name = "CategoryAdvertising" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryArchiver" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryContentFetcher" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryEmailClient" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryHttpLibrary" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryLinkChecker" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMiscellaneous" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryMonitoring" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryScrapingFramework" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySearchEngine" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySecurity" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategorySocialMedia" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "CategoryAI" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalAutomatedBrowser" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalKnownBotDataCenter" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SignalNonBrowserUserAgent" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-bot-control-test" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "core-rule-group" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - rule_action_override {
                      - name = "EC2MetaDataSSRF_QUERYARGUMENTS" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                  - rule_action_override {
                      - name = "SizeRestrictions_BODY" -> null

                      - action_to_use {
                          - allow {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-core-test" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "known-bad-inputs-rule-group" -> null
          - priority = 3 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-known-bad-inputs-test" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "managed-ip-blocking" -> null
          - priority = 0 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-ip-block-test" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "sqli-rule-group" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesSQLiRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "iiif-cloudfront-acl-sqli-test" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "geo-rate-limit-APAC"
          + priority = 3

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 500

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "CN",
                              + "SG",
                              + "HK",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-apac-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "geo-rate-limit-LATAM"
          + priority = 4

          + action {
              + block {
                  + custom_response {
                      + response_code            = 429
                        # (1 unchanged attribute hidden)
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "CONSTANT"
                  + evaluation_window_sec = 60
                  + limit                 = 200

                  + scope_down_statement {
                      + geo_match_statement {
                          + country_codes = [
                              + "BR",
                            ]
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-geo-rate-limit-latam-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "blanket-rate-limiting"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2500
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-acl-rate-limit-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "lenient-rate-limiting"
          + priority = 7

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 10000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-lenient-rate-limit-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "restrictive-rate-limiting"
          + priority = 6

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000

                  + scope_down_statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "URL_DECODE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-weco-cloudfront-restrictive-rate-limit-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "bot-control-rule-group"
          + priority = 13

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + managed_rule_group_configs {
                        # (2 unchanged attributes hidden)

                      + aws_managed_rules_bot_control_rule_set {
                          + enable_machine_learning = true
                          + inspection_level        = "COMMON"
                        }
                    }

                  + rule_action_override {
                      + name = "CategoryAdvertising"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryArchiver"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryContentFetcher"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryEmailClient"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryHttpLibrary"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryLinkChecker"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMiscellaneous"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryMonitoring"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryScrapingFramework"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySearchEngine"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySecurity"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategorySocialMedia"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "CategoryAI"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalAutomatedBrowser"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalKnownBotDataCenter"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SignalNonBrowserUserAgent"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-bot-control-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "core-rule-group"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + rule_action_override {
                      + name = "EC2MetaDataSSRF_QUERYARGUMENTS"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SizeRestrictions_BODY"

                      + action_to_use {
                          + allow {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-core-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "known-bad-inputs-rule-group"
          + priority = 12

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-known-bad-inputs-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "managed-ip-blocking"
          + priority = 0

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-ip-block-test"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "sqli-rule-group"
          + priority = 11

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "iiif-cloudfront-acl-sqli-test"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 7 to change, 0 to destroy.
```